//Version: v0.01
package models

type SSV0000002I struct {
	ProductStatus string `json:"productStatus" validate:"required,max=1" description:"prduct status"` //产品状态 1-正常(能被客户购买与使用);2-不开放(不能被客户购买，但能被使用（如有存量数据）);2-作废(不能被客户购买或使用);3-衍生产品（基于其他产品才能签约购买和使用）;-
}

type SSV0000002O struct {
	RecordTotalNum int                 `json:"recordTotalNum" description:"Total number of records"` //总记录数
	Records        []SSV0000002ORecord `json:"records" description:"Contract information"`
}

type SSV0000002ORecord struct {
	ProductId                string `json:"productId" description:"product code"`                 //产品号
	ProductNumber            int    `json:"productNumber" description:"product serial number"`    //产品顺序号
	ProductNameCh            string `json:"productNameCh" description:"product Chinese name"`     //产品中文名称
	ProductNameEn            string `json:"productNameEn" description:"product English name"`     //产品英文名称
	Currency                 string `json:"currency" description:"currency"`                      //币种 156-人民币;344-香港元;840-美元;392-日元;826-英镑;756-瑞士法郎;280-德国马克;250-法国法郎;702-新加坡元;528-荷兰盾;208-丹麦克郎;578-挪威克郎;040-奥地利先令;056-比利时法郎;380-意大利里拉;124-加元;036-澳大利亚元;458-马来西亚林吉特;978-欧元;446-澳门元;608-菲律宾比索;554-新西兰元;000-未知币种;004-阿富汗尼;008-列克;012-阿尔及利亚第纳尔;020-安道尔比赛塔;031-阿塞拜疆马纳特;032-阿根廷比索;044-巴哈马元;048-巴林第纳尔;050-塔卡;051-亚美尼亚达姆;052-巴巴多斯元;060-百慕大元;064-努尔特鲁姆;068-玻璃瓦诺;072-普拉;084-伯利兹元;090-所罗门群岛元;096-文莱元;024-新克瓦查;100-列弗;104-缅元;108-布隆迪法郎;116-瑞尔;132-佛得角埃斯库多;136-开曼群岛元;144-斯里兰卡卢比;152-智利比索;170-哥伦比亚比索;174-科摩罗法郎;188-哥斯达黎加科郎;191-克罗地亚库纳;192-古巴比索;196-塞浦路斯镑;203-捷克克郎;214-多米尼加比索;222-萨尔瓦多科郎;230-埃塞俄比亚比尔;233-克罗姆;238-福克兰群岛镑;242-斐济元;246-马克;262-吉布提法郎;270-达拉西;288-塞地;292-直布罗陀镑;300-德拉克马;320-格查尔;324-几内亚法郎;328-圭亚那元;332-古德;340-伦皮拉;348-福林;352-冰岛克郎;356-印度卢比;360-卢比;364-伊朗里亚尔;368-伊拉克第纳尔;372-爱尔兰镑;376-锡克尔;388-牙买加元;398-坚戈;400-约旦第纳尔;404-肯尼亚先令;408-北朝鲜圆;410-圆;414-科威特第纳尔;417-索姆;418-基普;422-黎巴嫩镑;426-罗提;428-拉托维亚拉特;430-利比里亚元;434-利比亚第纳尔;440-立陶宛;442-卢森堡法郎;450-马尔加什法郎;454-克瓦查（马拉维）;462-卢菲亚;470-马尔他里拉;478-乌吉亚;480-毛里求斯卢比;484-墨西哥比索;496-图格里克;498-摩尔瓦多列伊;504-摩洛哥迪拉姆;508-麦梯卡尔;512-阿曼里亚尔;516-纳米比亚元;524-尼泊尔卢比;532-荷属安的列斯盾;533-阿鲁巴盾;548-瓦图;558-金科多巴;566-奈拉;586-巴基斯坦卢比;590-巴波亚;598-基那;600-瓜拉尼;604-索尔;620-葡萄牙埃斯库多;624-几内亚比绍比索;626-东帝汶埃斯库多;634-卡塔尔里亚尔;642-列伊;646-卢旺达法郎;654-圣赫勒拿镑;678-多布拉;682-沙特里亚尔;690-塞舌尔卢比;694-利昂;703-斯洛伐克克郎;704-盾;705-托拉尔;706-索马里先令;710-兰特;716-津巴布韦元;724-西班牙比赛塔;736-苏丹第纳尔;740-苏里南盾;748-里兰吉尼;752-瑞典克郎;760-叙利亚镑;764-泰国铢;776-邦加;780-特立尼达和多巴哥元;784-UAE迪拉姆;788-突尼斯第纳尔;792-土耳其里拉;795-马纳特;800-乌干达先令;807-第纳尔;810-俄罗斯卢布;818-埃及镑;834-坦桑尼亚先令;858-乌拉圭比索;860-乌兹别克斯坦苏姆;862-博利瓦;882-塔拉;886-也门里亚尔;894-克瓦查（赞比亚）;901-新台湾元;950-CFA法郎BEAC;951-东加勒比元;952-CFA法郎BCEAO;953-CFP法郎;955-欧洲货币合成单位（EURCO）;956-欧洲货币（单位EMU.-6）;957-欧洲账户9单位（E.U.A.-9）;958-欧洲账户17单位（E.U.A.-17）;959-黄金;960-特别提款权;961-银;962-铂白金;963-为测试特别保留的代码;964-钯;972-索莫尼;974-白俄罗斯卢布;975-保加利亚列弗;976-刚果法郎;977-可自由兑换标记;979-墨西哥发展单位;980-格里夫纳;981-里拉;984-Mvdol;985-兹罗提;986-巴西瑞尔;990-发展单位;991-特别清算货币;992-黄金法郎（实体）;993-UIC法郎;994-黄金法郎（测试）;995-无通用货币;996-债券市场单位;997-美元次日;998-美元同日;999-记账瑞士法郎;232-纳克法;891-南斯拉夫第纳尔;-
	OffShoreOnshoreSignature string `json:"offShoreOnshoreSignature" description:"offshore sign"` //离在岸标志 N-不区分;A-在岸;L-离岸;-
	TermFlag                 string `json:"termFlag" description:"product staging mark"`          //产品分期标志 1-不分期；2-分期
	DepositPeriodUnit        string `json:"depositPeriodUnit" description:"deposit period unit"`  //存期单位 如果产品分期标志=2，则返回本字段信息
	DepositPeriod            int    `json:"depositPeriod" description:"deposit period"`           //存期 如果产品分期标志=2，则返回本字段信息
}

func (*SSV0000002I) GetServiceKey() string {
	return "ssv0000002"
}
